# Homebrew Bundle — lukeholder/dotfiles
# Install everything with: brew bundle --global
# https://github.com/Homebrew/homebrew-bundle

# ---------------------------------------------------------------------------
# Taps
# ---------------------------------------------------------------------------
tap "ddev/ddev"
tap "stripe/stripe-cli"
tap "ngrok/ngrok"

# ---------------------------------------------------------------------------
# CLI Tools
# ---------------------------------------------------------------------------
brew "bat"                  # Better cat
brew "chezmoi"              # Dotfile manager
brew "ddev"                 # PHP Development on Docker
brew "delta"                # Better git diffs
brew "difftastic"           # Structural diff tool
brew "eza"                  # Modern ls replacement
brew "fd"                   # Fast find replacement
brew "ffmpeg"               # Audio/video processing
brew "fzf"                  # Fuzzy finder
brew "gh"                   # GitHub CLI
brew "git"                  # Latest Git
brew "jq"                   # JSON processor
brew "lazygit"              # TUI git client
brew "mise"                 # Runtime version manager
brew "mkcert"               # Local TLS certificates
brew "neovim"               # Neovim text editor
brew "ripgrep"              # Fast grep (rg)
brew "tldr"                 # Practical man page summaries
brew "tmux"                 # Terminal multiplexer
brew "starship"             # Cross-shell prompt
brew "speedtest-cli"        # Internet speed test (Speedtest.net)
brew "zoxide"               # Smarter cd
brew "stripe/stripe-cli/stripe" # Stripe CLI

# ngrok — expose local servers to the internet
cask "ngrok"

# ---------------------------------------------------------------------------
# Cask Applications
# ---------------------------------------------------------------------------

# Browsers
cask "google-chrome"
cask "firefox"

# Terminal
cask "ghostty"

# Editors & IDEs
cask "jetbrains-toolbox"    # JetBrains IDE manager
cask "visual-studio-code"

# API Tools
cask "bruno"                # Open-source API client

# Communication & Productivity
cask "cleanshot"            # Screenshot & recording
cask "swish"                # Trackpad gesture app
cask "slack"                # Team messaging
cask "linear-linear"        # Linear issue tracker
cask "notion"               # Note-taking & wiki
cask "obsidian"             # Markdown knowledge base

# AI
cask "claude"                    # Claude desktop app (Anthropic)

# Security & Password Management
cask "1password"            # Password manager

# Networking
cask "tailscale-app"            # VPN mesh network

# File Transfer
cask "transmit"             # File transfer (S3, SFTP, etc.)

# Database
cask "tableplus"            # Database GUI

# Version Control GUI
cask "tower"                # Git Tower GUI
cask "kaleidoscope"         # Diff & merge tool

# Containers & Virtualisation
cask "orbstack"             # Docker / Linux VMs (OrbStack)

# Flashing / Imaging
cask "balenaetcher"         # Bootable USB drive flasher

# ---------------------------------------------------------------------------
# Mac App Store (requires: brew install mas)
# ---------------------------------------------------------------------------
# Uncomment after signing into the Mac App Store:
# brew "mas"
# mas "1Password for Safari", id: 1569813296
